app/controllers/notes_controller.rb

    def index
      @notes = Note.where(user_id: current_user)
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]

    def create
      @note = current_user.notes.build(note_params)

      if @note.save
---
INSERT INTO "notes" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "My practice"], ["content", "dot new"], ["created_at", "2019-06-08 10:32:06.189413"], ["updated_at", "2019-06-08 10:32:06.189413"], ["user_id", 1]]

    def update
        if @note.update(note_params)
---
UPDATE "notes" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["title", "My client"], ["content", "About his name"], ["updated_at", "2019-06-08 10:09:17.695378"], ["id", 7]]